const questions = [
  {
    "title": "{תוצאה}",
    "question": "תוצאה לחקירה",
    "placeholder": "תוצאה",
    "dialogeType": "horizontal",
    "answer": "",
  },
  {
    "title": "{סיבה}",
    "question": "מה הסיבה ש{תוצאה}?",
    "dialogeType": "horizontal",
    "placeholder": "סיבה",
    "answer": "",
    "ref": ["{תוצאה}"],
  },
  {
    "title": "{תוצאההופכית}",
    "question": "מה ההיפך של {תוצאה}?",
    "placeholder": "תוצאה הופכית",
    "dialogeType": "horizontal",
    "answer": "",
    "ref": ["{תוצאה}"],
  },
  {
    "title": "{סיבההופכית}",
    "question": "מה ההיפך של {סיבה}?",
    "placeholder": "סיבה הופכית",
    "dialogeType": "horizontal",
    "answer": "",
    "ref": ["{סיבה}"],
  },
  {
    "title": "{האםהתוצאהמחוייבת}",
    "question": "האם התוצאה מחוייבת?<br>האם זה נכון ב 100% ש{תוצאה}?",
    "dialogeType": "prompt",
    "answer": "",
    "ref": ["{תוצאה}"],
    "buttons": { "a": "לא מחויב", "b": "מחויב" },
    "css":
            [{"color": [{"האם התוצאה מחוייבת?":"#8c94a8"}]},
            ]
  },
  {
    "title": "{האםהסיבהמחוייבת}",
    "question": "האם הסיבה מחויבת?<br>האם זה נכון ב 100% ש{סיבה}?",
    "dialogeType": "prompt",
    "answer": "",
    "buttons": { "a": "לא מחויב", "b": "מחויב" },
    "ref": ["{סיבה}"],
    "css":
            [{"color": [{"האם הסיבה מחויבת?":"#8c94a8"}]},
            ]
     
  },
  {
    "title": "{האםהסיבהמחייבת}",
    "question": "האם הסיבה מחייבת את התוצאה?<br>האם זה ש{סיבה} מחייב ש{תוצאה}?<br>אולי זה ש{סיבה} יכול להוביל לתוצאה אחרת או אפילו לכך ש{תוצאההופכית}?",
    "dialogeType": "prompt",
    "answer": "",
    "buttons": { "a": "לא מחויב", "b": "מחויב" },
    "ref": ["{תוצאה}","{סיבה}","{סיבה}","{תוצאההופכית}"],
    "css":
            [{"color": [{"האם הסיבה מחייבת את התוצאה?":"#8c94a8"}]},
            ]
      
  },
  {
    "title": "{האםהתוצאהמחייבת}",
    "question": "האם התוצאה מתחייבת מהסיבה?<br>האם זה ש{תוצאה} מתחייב מכך ש{סיבה}?<br>אולי {תוצאה} מסיבה אחרת? ואולי אפילו להיפך ו{תוצאה} כי {סיבההופכית}?",
    "dialogeType": "prompt",
    "answer": "",
    "buttons": { "a": "לא מחויב", "b": "מחויב" },
    "ref": ["{תוצאה}","{סיבה}","{סיבההופכית}","{תוצאה}","{תוצאה}"],
    "css":
            [{"color": [{"האם התוצאה מתחייבת מהסיבה?":"#8c94a8"}]},
            ],
     "buttons": { "a": "חדש"},
     "next":{"a":"{תוצאה}"}
  }
  ]

  export default questions;